app/views/galleries/index.html.erb

          <div class="thumbnail">
            <% if gallery.cover.blank? or !Picture.find_by_id(gallery.cover) %>
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = 2 LIMIT 1